БухЭксп/Catalogs/CW_КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_КонтактнаяИнформация</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
				<xr:Item>Catalog.CW_КонтактыеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛичнаяКИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_КонтактнаяИнформация/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если (Объект.Ссылка.Пустая()) Тогда
		Объект.Владелец = Параметры.ЗначенияЗаполнения.Владелец;
	КонецЕсли; 
	// --- 
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	_УправлениеЭлементамиФормы();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_КонтактнаяИнформация.Ссылка
	               |ИЗ
	               |	Справочник.CW_КонтактнаяИнформация КАК CW_КонтактнаяИнформация
	               |ГДЕ
	               |	CW_КонтактнаяИнформация.Основной = ИСТИНА
	               |	И CW_КонтактнаяИнформация.Владелец = &Владелец
	               |	И CW_КонтактнаяИнформация.ВидКИ = &ВидКИ
	               |	И CW_КонтактнаяИнформация.Ссылка <> &Ссылка
	               |	И CW_КонтактнаяИнформация.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	Запрос.УстановитьПараметр("ВидКИ", Объект.ВидКИ);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка); 
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если (Объект.Основной) Тогда
		
		Если (ТЗ.Количество() <> 0) Тогда
			
			Для каждого Стр Из ТЗ Цикл
				
				СтрО = Стр.Ссылка.ПолучитьОбъект();
				СтрО.Основной = ЛОжь;
				СтрО.Записать();
				
			КонецЦикла; 
			
		КонецЕсли; 		
		
	Иначе
		
		Если (ТЗ.Количество() = 0) Тогда
			
			ТекущийОбъект.Основной = Истина;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОЗаписиНового(Объект.Ссылка);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Заголовок = Строка(Объект.Владелец);
	
	Если (ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Контрагенты")) Тогда
		
		Элементы.ВариантКИ.Видимость = Ложь;
		
	Иначе
		
		Элементы.ВариантКИ.Видимость = Истина;
		Если (ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.CW_КонтактыеЛица")) Тогда
			
			ВариантКИ = 0;
			Если (НЕ Объект.Владелец.ФизическоеЛицо.Пустая()) Тогда
				
				Элементы.ВариантКИ.ТолькоПросмотр = Ложь;
				
			Иначе
				
				Элементы.ВариантКИ.ТолькоПросмотр = Истина;
				
			КонецЕсли; 
			
		Иначе
			
			Элементы.ВариантКИ.ТолькоПросмотр = Ложь;
			ВариантКИ = 1;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры
 

// --- 

&НаКлиенте
Процедура ЛичнаяКИПриИзменении(Элемент)
	
	_ЛичнаяКИПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура _ЛичнаяКИПриИзменении()
	// --- 
	
	Объект.Владелец = Объект.Владелец.ФизическоеЛицо;
	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВариантКИПриИзменении(Элемент)
	
	Если (ВариантКИ = 1) Тогда
		
		Объект.ЛичнаяКИ = Истина;
		_ЛичнаяКИПриИзменении();
		
	Иначе
		
		// спрашиваем контактное лицо
		ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораКонтактногоЛица",ЭтотОбъект, Новый Структура()); 
		ПФ = Новый Структура("Физлицо",Объект.Владелец);
		ОткрытьФорму("Справочник.CW_КонтактыеЛица.Форма.ФормаВыбораКонтактногоЛицаПоФизлицу",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКонтактногоЛица(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Объект.ЛичнаяКИ = Ложь;
		ВариантКИ = 0;
		Объект.Владелец = Ответ;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ОткрытьКИ(Команда)
	
	// открываем КИ
	_УФК.ОткрытьКонтактнуюИнформацию(Объект.Ссылка);
	
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
